app/Controllers/Home.php

UPDATE `user` SET `nama` = 'Husna Putri', `email` = 'husnaedit@gmail.com', `password` = 'husnaedit', `gambar` = 'cw3.jpeg', `updated_at` = '2022-06-14 00:44:37'
WHERE `user`.`id` IN ('14')
---
	public function update()
	{
		//Validasi
		$this->_validate('update');

		$id = $this->request->getVar('id');
		$user = $this->model->find($id);

		if ($this->request->getFile('gambar') == '') {
			$gambarName = $user['gambar'];
		} else {
			//Hapus Gambar Sebelumnya
			unlink('uploads/' . $user['gambar']);

			//File Gambar
			$gambar = $this->request->getFile('gambar');
			$gambar->move('uploads');
			$gambarName = $gambar->getName();
		}

		$data = [
			'id' => $id,
			'nama' => $this->request->getVar('nama'),
			'email' => $this->request->getVar('email'),
			'password' => $this->request->getVar('password'),
			'gambar' => $gambarName,
		];

		if ($this->model->save($data)) {

DELETE FROM `user`
WHERE `id` IN ('12')
---
	public function delete($id)
	{
		$user = $this->model->find($id);

		//Hapus Gambar Sebelumnya
		if ($user['gambar']) {
			unlink('uploads/' . $user['gambar']);
		}

		if ($this->model->delete($id)) {